comandos basicos del uso de pandas en python

In [1]:
import pandas as pd

creemos un dict que nos permitira crear un dataframe  
dos columnas, apple and orange   
y luego las lineas indican la cantidad comprada por cada cliente

In [9]:
data = {
    'apples' : [3, 2, 0, 1],
    'oranges' : [0, 3, 7, 2]
}

y ahora se lo pasamos al constructor de dataframes de pandas

In [11]:
purchases = pd.DataFrame(data)

In [12]:
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

the index is automatic.  
however we can choose our own

In [14]:
purchases = pd.DataFrame(data, index=['Julian', 'Penelope', 'Ramon', 'Bob'])

In [15]:
purchases

          apples  oranges
Julian         3        0
Penelope       2        3
Ramon          0        7
Bob            1        2

now we can locate customers orders using their name  
and the loc function

In [18]:
purchases.loc['Julian']

apples     3
oranges    0
Name: Julian, dtype: int64

* now lets try to read a csv file

In [19]:
df = pd.read_csv('titanic.csv')

In [20]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

we can also select which column to make the index

In [ ]:
df = pd.read_csv('purchases.csv', index_col=0)

we can also use pandas to read json

df = pd.read_json('purchases.json')

if you’re working with data from a SQL database you need to first establish a connection using an appropriate Python library, then pass a query to pandas.

!pip install pysqlite3

import sqlite3

con = sqlite3.connect("database.db")

df = pd.read_sql_query("SELECT * FROM purchases", con)

## tip  
si te conectas a PostgreSQL, MySQL, o cualquier otro servidor SQL, debes utilizar la libreria the python correcta. por ejemplo, `psycopg2` [link](http://initd.org/psycopg/download/) es para hacer conexiones a PostgreSQL.   
tambien ten en cuenta que te conectas al URI de la base de datos en ves de un archivo, como se muestra en el ejemplo anterior

### Convertir de un tipo a otro - json a csv o sql

df.to_csv('new_purchases.csv')

df.to_json('new_purchases.json')

df.to_sql('new_purchases', con)

### usemos un ejemplo concreto con la base de datos de IMDB

In [2]:
movies_df = pd.read_csv("IMDB-Movie-Data.csv", index_col="Title")

In [16]:
movies_df.head()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [6]:
movies_df.tail(2)

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

### informacion acerca del dataset

In [17]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Genre               1000 non-null   object
 2   Description         1000 non-null   object
 3   Director            1000 non-null   object
 4   Actors              1000 non-null   object
 5   Year                1000 non-null   int64
 6   Runtime (Minutes)   1000 non-null   int64
 7   Rating              1000 non-null   float64
 8   Votes               1000 non-null   int64
 9   Revenue (Millions)  872 non-null    float64
 10  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(4)
memory usage: 93.8+ KB

### shape te da un simple tuple con las dimensiones del dataset   
en este caso 1000 lineas con 11 columnas.  
fijate que shape no tiene parentesis

In [18]:
movies_df.shape

(1000, 11)

### borrar duplicados.  
es muy importante borrar los duplicados en un dataset.  
a modo de ejemplo vamos a duplicar la tabla y luego le diremos que borre los duplicados

In [21]:
temp_df = movies_df.append(movies_df)

temp_df.shape

(2000, 11)

In [20]:
temp_df = temp_df.drop_duplicates()

temp_df.shape

(1000, 11)

### utilizar inplace te ahorra usar una variable temporal
`inplace`

In [22]:
temp_df.drop_duplicates(inplace=True)

temp_df.shape

(1000, 11)

`drop_duplicates` tiene unos argumentos muy utiles.   
`first` (default) Elimina los duplicados excepto la primer ocurrencia   
`last` Elimina los duplicados except la ultima ocurrencia.  
`False` Elimina todos los duplicados

In [23]:
temp_df = movies_df.append(movies_df)  # crea una copia nueva

temp_df.drop_duplicates(inplace=True, keep=False)

temp_df.shape

(0, 11)

**en el ejemplo anterior se borraron todas las lineas**

### Limpiando las columnas

In [3]:
movies_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

### podemos renombrar columnas

In [4]:
movies_df.rename(columns={
    'Runtime (Minutes)': 'Runtime',
    'Revenue (Millions)': 'Revenue_millions'
}, inplace=True)

movies_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year', 'Runtime',
       'Rating', 'Votes', 'Revenue_millions', 'Metascore'],
      dtype='object')

### podemos volver minusculas todos los nombres de las columnas

In [5]:
movies_df.columns = [col.lower() for col in movies_df]

movies_df.columns

Index(['rank', 'genre', 'description', 'director', 'actors', 'year', 'runtime',
       'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

### TIP.  
es una buena idea volver todos los titulos minusculas, retirar caracteres especiales y reemplazar espacios con barra al piso

### Manejo de valores vacios

python identifica valores vacios como `None` y numpy como `np.nan`   
existen dos alternativas.   
1. borrar las columnas o lineas con valores vacios.   
2. reemplazar con valores `non-null` tecnica llamada `imputation`   

empezemos por encontrar esos valores nulos

In [6]:
movies_df.isnull()

,rank,genre,description,director,actors,year,runtime,rating,votes,revenue_millions,metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,False,False,False,False,False,False,False,False,False,False,False
Prometheus,False,False,False,False,False,False,False,False,False,False,False
Split,False,False,False,False,False,False,False,False,False,False,False
Sing,False,False,False,False,False,False,False,False,False,False,False
Suicide Squad,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,False,False,False,False,False,False,False,False,False,True,False
Hostel: Part II,False,False,False,False,False,False,False,False,False,False,False
Step Up 2: The Streets,False,False,False,False,False,False,False,False,False,False,False
Search Party,False,False,False,False,False,False,False,False,False,True,False
Nine Lives,False,False,False,False,False,False,False,False,False,False,False

`.isnull` devuelve True o False segun la respuesta a si es null

Para calcular el numero de nulos en cada columna usamos la siguiente funcion `sum`

In [7]:
movies_df.isnull().sum()

rank                  0
genre                 0
description           0
director              0
actors                0
year                  0
runtime               0
rating                0
votes                 0
revenue_millions    128
metascore            64
dtype: int64

que es mejor?    
borrar o imputar los datos nulos?    
si la cantidad de datos nulos es pequeña entonces la sugerencia es borrarlos

movies_df.dropna()

el comando anterior eliminara todas las lineas con valores nulos y nos devolvera ese valor, pero no actualizara el DataFrame original de movies_df.    
entonces recuerda usar la opcion de `inplace=True`    

seria `movies_df.dropna(inplace=True)`

el problema de borrar la linea es que tambien sacrificamos las columnas que si tienen data.   
por eso es mejor `inputation`.  

pero antes de ver imputation veamos el equivalente de borrar columnas que es `movies_df.dropna(axis=1)`   

por que `axis=1`?    
la explicacion esta en el comando `movies_df.shape`    
 `Out: (1000, 4)`.   
donde 1000 es index `0` osea la axis `y`  
y la axis `x` es index `1` osea las columnas

### Imputation   
es una tecnica para mantener datos que son nulos.    
lo mejor es reemplazar el dato vacio con la `median` de la columna

limpiemos los valores vacios de la columna `revenue_millions`

In [8]:
revenue = movies_df['revenue_millions']

In [9]:
revenue.head()

Title
Guardians of the Galaxy    333.13
Prometheus                 126.46
Split                      138.12
Sing                       270.32
Suicide Squad              325.02
Name: revenue_millions, dtype: float64

ahora vamos a reemplazar los valores vacios con la `median` de la columna revenue

In [10]:
revenue_mean = revenue.mean()

In [12]:
revenue_mean

82.95637614678898

ahora con este valor rellenemos los valores nulos    
se hace con `fillna`

In [14]:
revenue.fillna(revenue_mean, inplace=True)

al usar `inplace=True` hemos actualizado el DataFrame original

lo podemos verificar volviendo a encontrar los valores vacios del DataFrame

In [16]:
movies_df.isnull().sum()

rank                 0
genre                0
description          0
director             0
actors               0
year                 0
runtime              0
rating               0
votes                0
revenue_millions     0
metascore           64
dtype: int64

Estuvo bien,  pero habria sido mucho mejor que hubieramos sacado la `median` por genero.   
eso nos hubiera dado un resultado mas granular y mas cercano a la realidad

### entendiendo las variables

In [8]:
movies_df.describe()

,rank,year,runtime,rating,votes,revenue_millions,metascore
count,1000.000000,1000.000000,1000.000000,1000.000000,1.000000e+03,872.000000,936.000000
mean,500.500000,2012.783000,113.172000,6.723200,1.698083e+05,82.956376,58.985043
std,288.819436,3.205962,18.810908,0.945429,1.887626e+05,103.253540,17.194757
min,1.000000,2006.000000,66.000000,1.900000,6.100000e+01,0.000000,11.000000
25%,250.750000,2010.000000,100.000000,6.200000,3.630900e+04,13.270000,47.000000
50%,500.500000,2014.000000,111.000000,6.800000,1.107990e+05,47.985000,59.500000
75%,750.250000,2016.000000,123.000000,7.400000,2.399098e+05,113.715000,72.000000
max,1000.000000,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

`.describe()` es util por que te muestra la distribucion de los datos continuos, esto es util para escoger el tipo de plot o diagrama para mostrar tus datos   
tambien lo puedes usar en una columna en particular

In [9]:
movies_df['genre'].describe()

count                        1000
unique                        207
top       Action,Adventure,Sci-Fi
freq                           50
Name: genre, dtype: object

`.value_counts()` nos da el numero de ocurrencias ordenadas de mayor a menor

In [12]:
movies_df['genre'].value_counts().head(10)

Action,Adventure,Sci-Fi       50
Drama                         48
Comedy,Drama,Romance          35
Comedy                        32
Drama,Romance                 31
Comedy,Drama                  27
Action,Adventure,Fantasy      27
Animation,Adventure,Comedy    27
Comedy,Romance                26
Crime,Drama,Thriller          24
Name: genre, dtype: int64

### Relaciones entre variables continuas

podemos encontrar la correlacion entre datos continuos usando el metodo `.corr()`

In [13]:
movies_df.corr()

,rank,year,runtime,rating,votes,revenue_millions,metascore
rank,1.000000,-0.261605,-0.221739,-0.219555,-0.283876,-0.271592,-0.191869
year,-0.261605,1.000000,-0.164900,-0.211219,-0.411904,-0.126790,-0.079305
runtime,-0.221739,-0.164900,1.000000,0.392214,0.407062,0.267953,0.211978
rating,-0.219555,-0.211219,0.392214,1.000000,0.511537,0.217654,0.631897
votes,-0.283876,-0.411904,0.407062,0.511537,1.000000,0.639661,0.325684
revenue_millions,-0.271592,-0.126790,0.267953,0.217654,0.639661,1.000000,0.142397
metascore,-0.191869,-0.079305,0.211978,0.631897,0.325684,0.142397,1.000000

Correlation tables are a numerical representation of the bivariate relationships in the dataset.   
si un numero sube y el otro sube tambien, entonces tenemos una correlacion positiva.   
si un numero sube y el otro baja entonces tenemos una correlacion negativa

por ejemplo la columna `rank` tiene una correlacion perfecta consigo misma.    
mientras que la correlacion entre `votes` y `revenue_millions` es de 0.6, interesante

la correlacion es util cuando quieres representar el porque una variable sube o baja en correlacion con otra.    
para representar estos datos lo mejor es usar un diagrama de `scatterplots`   

aqui puedes encontrar mas informacion en sumarizacion de datos.   
[Essential Statistics for Data Scientist](https://www.learndatasci.com/tutorials/data-science-statistics-using-python/)

Por el momento hemos aprendido a leer los datos desde `csv`   
como ver la informacion del `DataFrame`   
tambien a extraer columnas y rellenar los valores vacios con `imputation`    

ahora veamos otras formas de manipular nuestros datos

### DataFrame slicing, selecting y extracting

Ya aprendimos como extraer una columna del dataset usando `''`

In [14]:
genre_col = movies_df['genre']

type(genre_col)

pandas.core.series.Series

Fijate como esto nos retorna una `serie`.   
si lo que quieres es extraer la columna como un `DataFrame` entonces debemos pasarle una lista de columnas    
que en nuestro caso es una lista de una sola columna

In [15]:
genre_col = movies_df[['genre']]

type(genre_col)

pandas.core.frame.DataFrame

fijate como ahora es un `DataFrame`   

ahora es muy facil adherir otra columna

In [16]:
subset = movies_df[['genre', 'rating']]

subset.head()

                                            genre  rating
Title
Guardians of the Galaxy   Action,Adventure,Sci-Fi     8.1
Prometheus               Adventure,Mystery,Sci-Fi     7.0
Split                             Horror,Thriller     7.3
Sing                      Animation,Comedy,Family     7.2
Suicide Squad            Action,Adventure,Fantasy     6.2

Ahora veamos como adquirir las `rows`    

tenemos dos opciones.  
`.loc` localiza segun el nombre.  
`.iloc` localiza segun el index   


Recuerda que nuestra columna `index` es `name`, entonces buscamos por nombre

In [21]:
prom = movies_df.loc["Prometheus"]

prom

rank                                                                2
genre                                        Adventure,Mystery,Sci-Fi
description         Following clues to the origin of mankind, a te...
director                                                 Ridley Scott
actors              Noomi Rapace, Logan Marshall-Green, Michael Fa...
year                                                             2012
runtime                                                           124
rating                                                              7
votes                                                          485820
revenue_millions                                               126.46
metascore                                                          65
Name: Prometheus, dtype: object

con esto sacamos toda la linea que tiene como nombre `["Prometheus"]`

si quisiera hacer lo mismo usando el `index` tendria que saberlo de antemano.   

en este caso `index = 1`

In [24]:
prom = movies_df.iloc[1]

prom

rank                                                                2
genre                                        Adventure,Mystery,Sci-Fi
description         Following clues to the origin of mankind, a te...
director                                                 Ridley Scott
actors              Noomi Rapace, Logan Marshall-Green, Michael Fa...
year                                                             2012
runtime                                                           124
rating                                                              7
votes                                                          485820
revenue_millions                                               126.46
metascore                                                          65
Name: Prometheus, dtype: object

`Slicing` utiliza `loc` y `iloc`.   
solo que tiene la ventaja de que puedes slice una porcion del DataFrame

In [25]:
movie_subset = movies_df.loc['Prometheus': 'Sing']

movie_subset = movies_df.iloc[1:4]

movie_subset

,rank,genre,description,director,actors,year,runtime,rating,votes,revenue_millions,metascore
Title,,,,,,,,,,,
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0

fijate como `slicing` con `iloc` no incluye la ultima pelicula    
solo tiene tres entradas a pesar de que el rango es `[1:4]`    

`iloc` sigue las mismas reglas de slicing con listas, en la cual la ultima entrada no se incluye

### Conditional Selections